Reports/КарточкаСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>КарточкаСотрудника</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/СертификатыФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СертификатыФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Если не  указана, то безсрочный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/АттестацияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>АттестацияСотрудников</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЧленыАттестационнойКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аттестуемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьПослеАттестации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РешенияАттестационнойКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатТестирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПрактическогоЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатГолосования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПереаттестации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательнаяПереаттестация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОбучениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ОбучениеСотрудников</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Учащиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/КарточкаСотрудника/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьАттестации( ФизЛицо )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АттестацияСотрудниковАттестуемые.Ссылка.ДатаНачала,
		|	АттестацияСотрудниковАттестуемые.Ссылка.ДатаОкончания,
		|	АттестацияСотрудниковАттестуемые.Решение,
		|	АттестацияСотрудниковАттестуемые.ДолжностьПослеАттестации,
		|	АттестацияСотрудниковАттестуемые.РезультатТестирования,
		|	АттестацияСотрудниковАттестуемые.РезультатПрактическогоЗадания,
		|	АттестацияСотрудниковАттестуемые.РезультатГолосования,
		|	АттестацияСотрудниковАттестуемые.ОбязательнаяПереаттестация,
		|	АттестацияСотрудниковАттестуемые.ДатаПереаттестации
		|ИЗ
		|	Документ.АттестацияСотрудников.Аттестуемые КАК АттестацияСотрудниковАттестуемые
		|ГДЕ
		|	АттестацияСотрудниковАттестуемые.ФизическоеЛицо = &ФизическоеЛицо
		|	И АттестацияСотрудниковАттестуемые.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции
	
&НаСервере
Функция ПолучитьСертификатыФизЛица( ФизЛицо )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыФизЛиц.ВидСертификата,
		|	СертификатыФизЛиц.НомерСертификата,
		|	СертификатыФизЛиц.Действительный,
		|	СертификатыФизЛиц.ДатаНачала КАК ДатаНачала,
		|	СертификатыФизЛиц.ДатаОкончания,
		|	СертификатыФизЛиц.ДатаВыбытия
		|ИЗ
		|	РегистрСведений.СертификатыФизЛиц КАК СертификатыФизЛиц
		|ГДЕ
		|	СертификатыФизЛиц.ФизическоеЛицо = &ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Функция ПолучитьОбучения( ФизЛицо )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбучениеСотрудниковУчащиеся.Ссылка.Курс.Наименование,
		|	ОбучениеСотрудниковУчащиеся.Ссылка.ДатаНачала КАК ДатаНачала,
		|	ОбучениеСотрудниковУчащиеся.Ссылка.ДатаОкончания,
		|	ОбучениеСотрудниковУчащиеся.Сумма,
		|	ОбучениеСотрудниковУчащиеся.Комментарий,
		|	ОбучениеСотрудниковУчащиеся.Ссылка.Организация,
		|	ОбучениеСотрудниковУчащиеся.Ссылка.Курс.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ОбучениеСотрудников.Учащиеся КАК ОбучениеСотрудниковУчащиеся
		|ГДЕ
		|	ОбучениеСотрудниковУчащиеся.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОбучениеСотрудниковУчащиеся.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере( ТабДок, ФизЛицо )
	//ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	ОблШ	= Макет.ПолучитьОбласть("Шапка");
	ОблШ.Параметры.ФизЛицо = ФизЛицо;
	ТабДок.Вывести( ОблШ );
	
	
	тзСертификаты = ПолучитьСертификатыФизЛица( ФизЛицо );
	Если тзСертификаты.Количество() > 0 Тогда
		ОблШС = Макет.ПолучитьОбласть("ШапкаСертификаты");
		ТабДок.Вывести( ОблШС );
		Для Каждого Сертификат ИЗ тзСертификаты Цикл
			ОблС = Макет.ПолучитьОбласть("Сертификат");
			ЗаполнитьЗначенияСвойств( ОблС.Параметры, Сертификат );
			ТабДок.Вывести( ОблС );
		КонецЦикла;
	КонецЕсли;
	
	тзОбучения = ПолучитьОбучения( ФизЛицо );
	Если тзОбучения.Количество() > 0 Тогда
		ОблШО = Макет.ПолучитьОбласть("ШапкаОбучение");
		ТабДок.Вывести( ОблШО );
		Для Каждого Обучение ИЗ тзОбучения Цикл
			ОблО = Макет.ПолучитьОбласть("Обучение");
			ЗаполнитьЗначенияСвойств( ОблО.Параметры, Обучение );
			ТабДок.Вывести( ОблО );
		КонецЦикла;
	КонецЕсли;
	
	тзАттестации = ПолучитьАттестации( ФизЛицо );
	Если тзАттестации.Количество() > 0 Тогда
		ОблША = Макет.ПолучитьОбласть("ШапкаАттестации");
		ТабДок.Вывести( ОблША);
		Для Каждого Аттестация ИЗ тзАттестации Цикл
			ОблА = Макет.ПолучитьОбласть("Аттестация");
			ЗаполнитьЗначенияСвойств( ОблА.Параметры, Аттестация );
			ОблА.Параметры.ПериодАттестации = "С " + Формат( Аттестация.ДатаНачала,  "ДЛФ=D") + " по " + Формат( Аттестация.ДатаОкончания,  "ДЛФ=D");
			
			ТабДок.Вывести( ОблА );
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СформироватьНаСервере( ТабДок, ФизическоеЛицо );
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.Показать("Карточка сотрудника " + ФизическоеЛицо );
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФизическоеЛицо = Параметры.ФизическоеЛицо;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать("");
	ЭтаФорма.Закрыть();
КонецПроцедуры
